[
  {
    "filename": "iphone_21",
    "totalcomments": 121,
    "datelast": "Oct 2, 2014, 08:49 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_21",
    "title": "Some iPhone 6 Plus Owners Accidentally Bending Their iPhones in Pockets  Mac Rumors",
    "author": "Kelly_Hodgkins",
    "date": "Tuesday September 23, 2014 8:01 am PDT",
    "image": "http://cdn.macrumors.com/article-new/2014/09/bent-iphone6-plus.jpg",
    "htmltext": "\t\t\t\t\t\tAs highlighted in a few reports <a href=\"http://forums.macrumors.com/showthread.php?t=1785905\">shared in the <em>MacRumors</em> forums</a>, a small but growing number of iPhone 6 Plus owners have reportedly bent their phones after carrying the devices in their pockets just days after launch. In <a href=\"http://forums.macrumors.com/showpost.php?p=19825874&amp;postcount=1\">one instance</a>, a new iPhone 6 Plus was bent during a day of dancing, dining, and driving to a wedding.  \r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/09/bent-iphone6-plus.jpg\" alt=\"bent-iphone6-plus\" width=\"800\" height=\"154\" class=\"aligncenter size-full wp-image-423391\" /><center><i><a href=\"http://forums.macrumors.com/showpost.php?p=19825874&amp;postcount=1\">Photo by hanzoh</a></i></center><blockquote>Yesterday, I left at 10am with the iPhone in my left FRONT pocket of my suit pants. I drove 4 hours to a wedding, which also involved a lot of sitting during dinner etc but also 2-3 hours of dancing. I left at 2am and went to bed, driving home 4 hours back.\r<br />\n<br />\nSo in total, the 6 Plus was about 18 hours in my pocket while sitting mostly.\r<br />\n<br />\nAs I lay it on the coffee table and sat down on the couch to relax from the drive (yes, sitting again ), I saw the reflection of the window in the iPhones slightly distorted. </blockquote>This potential for bending is of course not unique to the iPhone 6 Plus, with reports of bent <a href=\"http://forums.macrumors.com/showthread.php?t=1452478\">iPhone 5</a> and <a href=\"http://forums.macrumors.com/showthread.php?t=1754349\">5s handsets</a> surfacing in the past few years. As iPhones get thinner and larger, however, storage of the handset in a pocket becomes riskier. Unlike smaller phones that can slide out of the way, pressure points from sitting or bending now have greater potential to cause the longer iPhone to flex in a way that will damage the device.  \r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/09/bent_iphone_6_plus.jpg\" alt=\"bent_iphone_6_plus\" width=\"704\" height=\"295\" class=\"aligncenter size-full wp-image-423400\" /><center><i><a href=\"http://forums.macrumors.com/showpost.php?p=19826437&amp;postcount=41\">Photo by DevinPitcher</a></i></center> <br />\nTo prevent bending, iPhone 6 Plus owners may want to remove their iPhones from their pockets before sitting or bending. If a pocket is unavoidable, then customers may want to place their device in a roomier pocket that allows the device to slide out the way. A rigid case may also provide protection from flexing or bending, as well damage from dropping the device. <br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_20",
    "totalcomments": 100,
    "datelast": "Oct 2, 2014, 06:23 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_20",
    "title": "iPhone 6 Plus Bending Limits Tested in New Video  ",
    "author": "Juli_Clover",
    "date": "Tuesday September 23, 2014 2:06 pm PDT",
    "htmltext": "\t\t\t\t\tEarlier today, we shared <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">several photos and videos</a> from iPhone 6 Plus users who accidentally bent their iPhones when carrying the device in their pockets, mere days after the phone's initial launch.\r<br />\n<br />\nFollowing this morning's news, YouTube video maker Lewis Hilsenteger of <a href=\"https://www.youtube.com/watch?v=znK652H6yQM\">Unbox Therapy</a> created a video exploring just how much an iPhone 6 Plus will bend when subjected to force. Using his hands, Hilsenteger bends the iPhone 6 Plus as much as he can, with significant warping showing up near the device's volume buttons.\r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/znK652H6yQM?feature=player_detailpage\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <br />\nThe force placed on the iPhone 6 Plus in the video is unlikely to be replicated in a pocket, but as several photos have demonstrated <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">in our earlier post</a>, it does not take much force to cause a slight curvature in the device. The iPhone 6 Plus does, however, remain functional after bending, but as noted by Hilsenger on <a href=\"https://twitter.com/UnboxTherapy/status/514519898488602624\">Twitter</a>, the device screen cracked when he attempted to bend it back into shape. \r<br />\n<br />\nBending issues are not limited to the iPhone 6 Plus, as previous generations of the iPhone, including the <a href=\"http://forums.macrumors.com/showthread.php?t=1452478\">iPhone 5</a> and the <a href=\"http://forums.macrumors.com/showthread.php?t=1754349\">iPhone 5s</a> have also seen complaints of bending after being subjected to a pocket.\r<br />\n<br />\nApple has not yet commented on the iPhone 6 Plus bending incidents, but iPhone 6 Plus owners can likely prevent bending by removing the phone from their pockets before sitting or bending, or by placing the device in a rigid protective case.\n                                        <div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_1",
    "totalcomments": 111,
    "datelast": "Nov 11, 2014, 04:14 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_1",
    "title": "Apple: Bending in iPhone 6 Plus From Normal Use Extremely Rare Only 9 Customers Have Complained  ",
    "author": "Juli_Clover",
    "date": "Thursday September 25, 2014 12:10 pm PDT",
    "image": "http://cdn.macrumors.com/article-new/2014/09/bent_iphone_6_plus.jpg",
    "htmltext": "\t\t\t\t\t\tApple has commented on the ongoing complaints about the iPhone 6 Plus bending in user pockets, telling <a href=\"https://twitter.com/CNBCtech/status/515198657180991488\">CNBC</a> that the new iPhones include steel/titanium inserts to reinforce stress locations and that they use the \"strongest glass in the industry.\"\r<br />\n<br />\nThe company <a href=\"https://twitter.com/CNBCtech/status/515199059112775680\">went on to say</a> that only nine customers had complained about bent iPhones, suggesting the issue is not as widespread as it has appeared in the media. It also <a href=\"http://www.ft.com/intl/fastft?post=211822\">stated</a> that both the iPhone 6 and 6 Plus have met or exceeded testing for strength and durability, and that <a href=\"http://online.wsj.com/articles/apple-defends-against-complaints-of-bending-iphones-1411668618\">bending</a> in the iPhone 6 Plus during normal use is \"extremely rare.\"\r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/09/bent_iphone_6_plus.jpg\" alt=\"bent_iphone_6_plus\" width=\"704\" height=\"295\" class=\"aligncenter size-full wp-image-423400\" /><blockquote>Our iPhones are designed, engineered and manufactured to be both beautiful and sturdy. iPhone 6 and iPhone 6 Plus feature a precision engineered unibody enclosure constructed from machining a custom grade of 6000 series anodized aluminum, which is tempered for extra strength. They also feature stainless steel and titanium inserts to reinforce high stress locations and use the strongest glass in the smartphone industry. We chose these high-quality materials and construction very carefully for their strength and durability. We also perform rigorous tests throughout the entire development cycle including 3-point bending, pressure point cycling, sit, torsion, and user studies. iPhone 6 and iPhone 6 Plus meet or exceed all of our high quality standards to endure everyday, real life use.\r<br />\n<br />\nWith normal use a bend in iPhone is extremely rare and through our first six days of sale, a total of nine customers have contacted Apple with a bent iPhone 6 Plus. As with any Apple product, if you have questions please contact Apple.</blockquote>Reports of the iPhone 6 Plus's weakness to bending first began trickling in on Monday, after several <em>MacRumors</em> <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">forum members</a> shared images of devices that had bent while in a pocket. The bending issue went viral after a YouTuber <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">posted a video</a> of the iPhone 6 Plus warping out of shape when bent in his hands, which caused significant damage near the device's volume buttons.\r<br />\n<br />\nGiven the media attention the bending received, it was difficult to tell how many users were truly affected by iPhone 6 Plus bending during real world usage. Though Apple kept quiet on the issue until today, the company has been directing its support staff to replace affected phones under warranty following a visual inspection.<br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_10",
    "totalcomments": 26,
    "datelast": "Sep 22, 2014, 04:58 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_10",
    "title": "iFixit Completes iPhone 5c Teardown Highlights Include Durable Shell Larger Battery  ",
    "author": "Juli_Clover",
    "date": "Friday September 20, 2014 11:35 am PDT",
    "htmltext": "\t\t\t\t\t\tFollowing last night's <a href=\"http://www.macrumors.com/2013/09/20/ifixits-iphone-5s-teardown-reveals-touch-id-fingerprint-sensor-invisible-m7-chip/\">teardown</a> of the iPhone 5s, <a href=\"http://www.ifixit.com/Teardown/iPhone+5c+Teardown/17382/1?utm_campaign=iFixit+Its+blue\">iFixit</a> has completed its iPhone 5c teardown. Unsurprisingly, the iPhone 5c's dismantling has revealed numerous similarities with the iPhone 5, including nearly identical innards with matching A6 processors.\r<br />\n<br />\nWhile the internals and form factor are largely the same, the iPhone 5c is slightly thicker and heavier than the iPhone 5 and due to its polycarbonate shell. The 5c also has a larger battery, measuring in at 1510 mAh compared to the 1440 mAh battery of the iPhone 5, and it shares camera parts with the iPhone 5s, though the latter has a larger aperture. iFixit found that the plastic shell was nearly impossible to bend, largely because of its heft – the rear case weighs in at 43.8 grams.\r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe src=\"//www.youtube.com/embed/4E55-y7s7Ek?feature=player_detailpage\" height=\"360\" width=\"640\" allowfullscreen=\"\" frameborder=\"0\"></iframe></div></div></center><blockquote>We may not have super strength, but we put this case to the muscle test, anyway. The results: this lacquered plastic is as strong and blue as Captain Planet.\r<br />\n<br />\nIt's good to know that, though the rear panel is made with plastic to presumably cut costs, Apple did not compromise build quality in the process.</blockquote>iFixit gave the iPhone 5c a 6 out of 10 repairability score, one point lower than the iPhone 5 and the same score given to the iPhone 5s, due to the lack of the pull tab on the battery, the proprietary screws, and the considerable amount of adhesive used to hold the phone together. iFixit has a number of other pictures and a detailed rundown of the iPhone 5c dismantling process <a href=\"http://www.ifixit.com/Teardown/iPhone+5c+Teardown/17382/\">on its website</a>.\n                                        <div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_11",
    "totalcomments": 110,
    "datelast": "Sep 22, 2014, 10:45 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_11",
    "title": "First iPhone 5c Reviews: Color is a Breath of Fresh Air Will Sell Like Hot Cakes  ",
    "author": "Juli_Clover",
    "date": "Tuesday September 17, 2014 7:49 pm PDT",
    "image": "http://cdn.macrumors.com/article-new/2013/09/iphone5c-header-800x658.jpg",
    "htmltext": "\t\t\t\t\t\tDuring its iPhone event that took place on September 10, Apple handed out a number of iPhone 5c review units to various publications. The embargo on reviews has just been lifted, which means a slew of sites are posting reactions to Apple’s colorful new phone lineup. We’ve gathered some interesting excerpts below to highlight the general reaction to the release.\r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2013/09/iphone5c-header-800x658.jpg\" alt=\"iphone5c-header\" width=\"800\" height=\"658\" class=\"aligncenter size-large wp-image-386624\" /> <br />\nDavid Pogue, <a href=\"http://www.nytimes.com/2013/09/18/technology/personaltech/in-arrival-of-2-iphones-3-lessons.html\"><em>The New York Times</em></a><blockquote>The budget model, the new iPhone 5C, comes in five colors (&#36;100 for the 16-gigabyte model with a two-year contract, &#36;550 without). It’s essentially identical to last year’s iPhone 5, except that its back and sides are a single piece of plastic instead of metal and glass.Actually, “plastic” isn’t quite fair. The 5C’s case is polycarbonate, lacquered like a glossy piano. Better yet, its back edges are curved for the first time since the iPhones of 2008. You can tell by touch which way it’s facing in your pocket.\r<br />\n<br />\nIt’s a terrific phone. The price is right. It will sell like hot cakes; the new iPhones go on sale Friday. But just sheathing last year’s phone in shiny plastic isn’t a stunning advance.</blockquote>Jim Dalrymple, <a href=\"http://www.loopinsight.com/2013/09/17/review-iphone-5c-and-iphone-5s/\"><em>The Loop</em></a> <br />\n<blockquote>There is absolutely no give to this phone at all. It doesn’t bend or buckle anywhere in the casing, which is what you want, obviously. It feels as solid as the 5s.\r<br />\n<br />\nThe iPhone 5c doesn’t actually feel like plastic. It’s strange when you first pick it up, but it almost feels like ceramic or a similar material that is glossy and hard. The manufacturing process that Apple used to make this phone and the metal reinforcement it used in the plastic casing certainly worked on making this phone tough.</blockquote>Darrell Etherington, <a href=\"http://techcrunch.com/2013/09/17/iphone-5c-review-apple/\"><em>TechCrunch</em></a><blockquote>To date, Apple’s choice of materials has been one of its prime differentiating factors, at least from an aesthetics point of view, vs. the Android crop of competitors. So does dipping back into a polycarbonate shell threaten the image Apple has tried so hard to cultivate?\r<br />\n<br />\nThe answer is a resounding ‘No.’ Apple notes that the iPhone 5c is actually polycarbonate because it wanted to get the colors just right, and doing so in metal just wasn’t feasible. Further, it points out that there’s a steel frame (which doubles as an antenna) girding that polycarbonate shell, which results in a phone that feels sturdy in the hand, without the flex or perceived fragility of other plastic device designs.</blockquote><center><div id=\"os_dmp_embed\"></div></center> <br />\nLauren Goode, <a href=\"http://allthingsd.com/20130917/5c-comes-in-candy-colors-at-a-nice-price-for-newcomers-or-thrifty-upgraders\"><em>AllThingsD</em></a><blockquote>The iPhone 5C has the same A6 processor and the same 4-inch Retina display as the iPhone 5. Colors on the 5C’s display look warmer.\r<br />\n<br />\nIt’s just slightly thicker and heavier than the iPhone 5. And while the 5C isn’t as refined-looking as the iPhone 5 or the new 5S, it isn’t a tacky plastic phone, either. I’ve tested plastic phones before, including the Samsung Galaxy S4 and the new Moto X from Motorola, and this phone feels more solid in the hand.</blockquote>Myriam Joire, <a href=\"http://www.engadget.com/2013/09/17/iphone-5c-review/\"><em>Engadget</em></a><blockquote>We’re not going to lie. The iPhone 5c is gorgeous – we’d even argue that it’s the most beautiful iPhone since the 4 and 4s. It instantly makes the iPhone 5 and 5s look staid in comparison.\r<br />\n<br />\nSure, we prefer materials like aluminum and glass over plastic, and we appreciate the intricate craftsmanship that goes into building the iPhone 5 and 5s, but still, we can’t help it – the 5c just triggers some reptilian part of our brains that screams, “OMG, color!”</blockquote><strong>Other reviews:</strong> <br />\n<br />\nAnand Shimpi, <a href=\"http://www.anandtech.com/show/7340/the-iphone-5c-review\"><em>AnandTech</em></a> <br />\nEdward Baig, <a href=\"http://www.usatoday.com/story/tech/columnist/baig/2013/09/17/iphone-ios-7-review/2823545/\"><em>USA Today</em></a> <br />\nStuart Miles, <a href=\"http://www.pocket-lint.com/review/123702-apple-iphone-5c-review\"><em>Pocket-Lint</em></a> <br />\nLuke Peters, <a href=\"http://www.t3.com/reviews/iphone-5c-review\"><em>T3</em></a> <br />\nScott Stein, <a href=\"http://reviews.cnet.com/iphone-5c/\"><em>CNET</em></a> <br />\n<br />\nApple’s iPhone 5c is currently <a href=\"http://store.apple.com/us/buy-iphone/iphone5c\">available for pre-order</a> and will begin shipping on September 20.<br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_2",
    "totalcomments": 93,
    "datelast": "Sep 29, 2014, 06:22 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_2",
    "title": "Samsung HTC BlackBerry and Others Mock Bendability of Apples iPhone 6 Plus  ",
    "author": "Kelly_Hodgkins",
    "date": "Thursday September 25, 2014 9:11 am PDT",
    "image": "http://cdn.macrumors.com/article-new/2014/09/bent_iphone_6_plus.jpg",
    "htmltext": "\t\t\t\t\t\tCompetition between mobile phone manufactures is fierce with handset companies using social media and other public platforms to call out their competitors. It's not surprising then to see a wave of tweets and comments from big name companies like Samsung and HTC mocking Apple following its recent iPhone 6 Plus <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">bending controversy</a>. \r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/09/bent_iphone_6_plus.jpg\" alt=\"bent_iphone_6_plus\" width=\"704\" height=\"295\" class=\"aligncenter size-full wp-image-423400\" /> <br />\nLG and HTC were among the first to attack Apple, commenting on Twitter shortly after the <a href=\"https://twitter.com/hashtag/bendgate?src=hash\">#bendgate</a> controversy began to escalate. At the same time, BlackBerry CEO John Chen mentioned the bending issue during the company's launch of its new Passport handset, saying \"I challenge you to bend the Passport,\" reports <a href=\"http://www.cnet.com/news/even-blackberry-is-making-fun-of-the-bendable-iphone-6/\"><em>CNET</em></a>.<center><blockquote class=\"twitter-tweet\" lang=\"en\"><p>Designed to withstand the most demanding environments. Like your pockets. <a href=\"https://twitter.com/hashtag/HTCOneM8?src=hash\">#HTCOneM8</a></p>&mdash; HTC USA (@HTCUSA) <a href=\"https://twitter.com/HTCUSA/status/514904626064150528\">September 24, 2014</a></blockquote></center> <center><blockquote class=\"twitter-tweet\" lang=\"en\"><p>Our phone doesn&#39;t bend, it flexes...on purpose. <a href=\"https://twitter.com/hashtag/bendgate?src=hash\">#bendgate</a> <a href=\"http://t.co/d1DudxDQgf\">pic.twitter.com/d1DudxDQgf</a></p>&mdash; LG USA Mobile (@LGUSAMobile) <a href=\"https://twitter.com/LGUSAMobile/status/514817371911901184\">September 24, 2014</a></blockquote> <br />\n</center> Samsung, <a href=\"https://twitter.com/NokiaHomebase/status/515108380365836289\">Nokia Deutschland</a>, and even candy maker and Android sponsor <a href=\"https://twitter.com/KITKAT/status/514817515177123841\">KitKat</a> also joined in on the mockery, noting that their products don't bend. <center><blockquote class=\"twitter-tweet\" lang=\"en\"><p>Curved. Not bent. <a href=\"https://twitter.com/hashtag/GALAXYNoteEdge?src=hash\">#GALAXYNoteEdge</a> <a href=\"http://t.co/OTPIYlI07f\">pic.twitter.com/OTPIYlI07f</a></p>&mdash; Samsung Mobile (@SamsungMobile) <a href=\"https://twitter.com/SamsungMobile/status/515074944485449728\">September 25, 2014</a></blockquote></center>These social marketing efforts are a response to Apple's controversy in which some iPhone 6 Plus users <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">were accidentally bending</a> their 5.5-inch handsets after placing them in their pockets. While the prevalence of the issue appears fairly low, photos of warped iPhone 6 Plus units spread like wildfire, with subsequent <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bend-video/\">\"bend test\" videos</a> showcasing how much the iPhone 6 Plus was susceptible to bending. \r<br />\n<br />\nAccording to <a href=\"http://thenextweb.com/apple/2014/09/24/apple-support-says-bent-iphones-must-pass-visual-inspection-qualify-warranty-replacement/\"><em>The Next Web</em></a>, Apple reportedly is looking into the issue \"with an insane amount of detail.\" A support representative also confirmed Genius technicians may replace bent phones under warranty following a visual inspection. Such inspections typically reject bent iPhones for warranty coverage, however, and it is unclear how much latitude Geniuses will have with this issue.<br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_3",
    "totalcomments": 114,
    "datelast": "Sep 25, 2014, 07:26 PM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_3",
    "title": "iPhone 6 Subjected to Bend Test Proves More Durable Than iPhone 6 Plus  ",
    "author": "Juli_Clover",
    "date": "Wednesday September 24, 2014 2:43 pm PDT",
    "htmltext": "\t\t\t\t\t\tApple's iPhone 6 Plus has been receiving a huge amount of attention over the last day, following reports of users seeing <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">significant bending</a> after placing the phone in a pocket.\r<br />\n<br />\nA video made yesterday <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bend-video/\">demonstrated</a>  just how far the iPhone 6 Plus is able to bend, and now the video's creator, Lewis Hilsenteger of <a href=\"https://www.youtube.com/watch?v=IROcoJeVfSI\">Unbox Therapy</a>, has created a second video to test the iPhone 6 and several other Android devices.\r<br />\n<br />\nThe smaller 4.7-inch iPhone 6 appears to be much less malleable than the larger iPhone 6 Plus. While the iPhone 6 Plus bent significantly near the volume buttons under the force inflicted by Hilsenteger, he is unable to do as much damage to the iPhone 6. Aside from a small dent, the phone remains intact. \"This one is far more durable,\" he says.\r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe src=\"//www.youtube.com/embed/IROcoJeVfSI?feature=player_detailpage\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <br />\nBased on his preliminary testing, Hilsenteger does not believe that iPhone 6 users will see the same issues that some iPhone 6 Plus users are seeing in regards to bending. As we noted yesterday, it's unlikely that the force Hilsenteger used in the original video will be replicated inside of a pocket, but photos of bent iPhone 6 Plus devices have suggested that it does not take much force to cause a slight curvature in the device.\r<br />\n<br />\nBending issues are not limited to the iPhone 6 Plus, as bending has been seen in prior versions of the iPhone, including the iPhone 5 and 5s.\r<br />\n<br />\nApple has not commented on the iPhone 6 Plus bending incidents, but iPhone 6 Plus owners can likely prevent bending by removing the phone from their pockets before sitting or by placing the device in a rigid protective case.<br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_4",
    "totalcomments": 6,
    "datelast": "Sep 23, 2014, 05:09 PM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_4",
    "title": "iPhone 6 Front Panel Subjected to Scratch Test, Significant Bending  ",
    "author": "dummy",
    "date": "Monday July 7, 2014 2:06 pm PDT",
    "htmltext": "\t\t\t\t\tEarlier today, we shared <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">several photos and videos</a> from iPhone 6 Plus users who accidentally bent their iPhones when carrying the device in their pockets, mere days after the phone's initial launch.\r<br />\n<br />\nFollowing this morning's news, YouTube video maker Lewis Hilsenteger of <a href=\"https://www.youtube.com/watch?v=znK652H6yQM\">Unbox Therapy</a> created a video exploring just how much an iPhone 6 Plus will bend when subjected to force. Using his hands, Hilsenteger bends the iPhone 6 Plus as much as he can, with significant warping showing up near the device's volume buttons.\r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/znK652H6yQM?feature=player_detailpage\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <br />\nThe force placed on the iPhone 6 Plus in the video is unlikely to be replicated in a pocket, but as several photos have demonstrated <a href=\"http://www.macrumors.com/2014/09/23/iphone-6-plus-bending-pockets/\">in our earlier post</a>, it does not take much force to cause a slight curvature in the device. The iPhone 6 Plus does, however, remain functional after bending, but as noted by Hilsenger on <a href=\"https://twitter.com/UnboxTherapy/status/514519898488602624\">Twitter</a>, the device screen cracked when he attempted to bend it back into shape. \r<br />\n<br />\nBending issues are not limited to the iPhone 6 Plus, as previous generations of the iPhone, including the <a href=\"http://forums.macrumors.com/showthread.php?t=1452478\">iPhone 5</a> and the <a href=\"http://forums.macrumors.com/showthread.php?t=1754349\">iPhone 5s</a> have also seen complaints of bending after being subjected to a pocket.\r<br />\n<br />\nApple has not yet commented on the iPhone 6 Plus bending incidents, but iPhone 6 Plus owners can likely prevent bending by removing the phone from their pockets before sitting or bending, or by placing the device in a rigid protective case.\n                                        <div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_5",
    "totalcomments": 106,
    "datelast": "Sep 2, 2014, 08:42 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_5",
    "title": "Sapphires Durability Put to the Test HeadtoHead Against Gorilla Glass  ",
    "author": "Kelly_Hodgkins",
    "date": "Friday August 29, 2014 9:25 am PDT",
    "image": "http://cdn.macrumors.com/article-new/2014/08/glass-sapphire.png",
    "htmltext": "\t\t\t\t\t\tRepair experts at uBreakiFix have examined the <a href=\"http://www.ubreakifix.com/blog/sapphire-screen-drop-test-the-kyocera-brigadier/\">impact resistance</a>, scratch resistance and <a href=\"http://www.ubreakifix.com/blog/sapphire-vs-gorilla-glass-bending-and-impact/\">strength</a> of sapphire glass in a series of tests that <a href=\"http://www.prnewswire.com/news-releases/sapphire-vs-gorilla-glass-in-ubreakifix-drop-tests-273164541.html\">were published</a> today. The tests were designed to determine whether sapphire is suitable for use as a smartphone display.\r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/08/glass-sapphire.png\" alt=\"glass-sapphire\" width=\"688\" height=\"303\" class=\"aligncenter size-full wp-image-420634\" /> <br />\nThe repair technicians conducted three different tests -- a scratch resistance comparison using a tungsten carbide drill bit, a  <a href=\"http://youtu.be/YmM8p2hx3k8\">drop test</a> with the sapphire display of the newly released Kyocera Brigadier, and a <a href=\"http://youtu.be/kVQbu_BsZ9o\">a four-point bend test</a> to compare the failure stress and strain of sapphire glass with that of Gorilla Glass. \r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/YmM8p2hx3k8\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <br />\nThe results of uBreakiFix's tests show that sapphire is significantly more scratch resistant and 25 percent stronger than Gorilla Glass, but it is much more susceptible to impacts due to its brittleness. The glass is so brittle that it shattered the first time it was dropped face down from a height of only three feet. \r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/kVQbu_BsZ9o\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <br />\nThe technicians conclude that sapphire does not necessarily offer any advantage over Gorilla Glass, as the material's superior scratch resistance and strength is offset by its low impact resistance. Phone manufacturers that include a sapphire display may choose to employ other protective measures such as a raised bezel to help protect the phone during impact with other surfaces. \r<br />\n<br />\nApple is partnering with GT Advanced Technologies <a href=\"http://www.macrumors.com/2013/11/05/a-look-at-how-gt-advanced-makes-sapphire-glass-for-smartphone-displays/\">to produce sapphire</a> for use in future products. The exact details on how Apple will use the material is not known, but the company is rumored to be using sapphire as <a href=\"http://www.macrumors.com/2014/08/22/gt-advanced-sapphire-display-amount-iphone6/\">a display cover</a> in future iPhone models and <a href=\"http://www.macrumors.com/2014/07/15/three-iwatch-models-high-end-sapphire/\">possibly</a> its iWatch wearable product. <br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_6",
    "totalcomments": 96,
    "datelast": "Aug 28, 2014, 05:57 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_6",
    "title": "Apple Reveals Furthers Details on Reversible USB Cable With Flexible Internal Connector  ",
    "author": "Kelly_Hodgkins",
    "date": "Thursday August 21, 2014 9:37 am PDT",
    "image": "http://cdn.macrumors.com/article-new/2014/08/apple-USB-patent-application.jpg",
    "htmltext": "\t\t\t\t\t\tThe U.S. Patent and Trademark Office today published another <a href=\"http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsrchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=%2220140235095%22.PGNR.&amp;OS=DN/20140235095&amp;RS=DN/20140235095\">Apple patent application</a> that describes a reversible USB connector with a \"double orientation design.\" (Via <a href=\"http://appleinsider.com/articles/14/08/21/apples-interest-in-reversible-usb-plugs-detailed-in-new-patent-application\"><em>AppleInsider</em></a>) Today's patent application, filed in February and titled \"Reversible USB Connector with Compliant Member to Spread Stress and Increase Contact Normal Force,\" differs slightly from a <a href=\"http://www.macrumors.com/2014/08/18/apple-reversible-usb-flipper/\">separate application</a> made a few weeks earlier by highlighting a key design detail that adds flexibility to the USB connector contacts.\r<br />\n<br />\nAccording to the patent description, the USB connector would feature a flexible tongue allowing it to bend to fit an existing USB port regardless of the insertion orientation. This flexible plug connector was mentioned briefly in the January patent, but Apple has expanded upon this idea in this latest patent application to address various types of support elements that would minimize stress on the flexible portion of the tongue while still ensuring strong contact between the connector and a USB port.<blockquote>As mentioned previously, some plug connectors of the present invention may include structural support elements made from materials chosen to allow plug connector tongues to deflect. Connector 1610 may also include a structural support element, e.g., a structural support 1635. Structural support 1635 may provide flexure to PCB 1632 to reduce stress and fatigue on PCB 1632 and allow tongue 1630, along with PCB 1632, to deflect toward and away from first or second inner surfaces 1620a, 1620b during insertion/extraction events. In order to provide this flexure, structural support 1635 may be made from an elastomer that deforms in response to stress, e.g., a mating event, but holds tongue 1630 centrally located between first and second inner surfaces 1620a, 1620b otherwise.</blockquote> As shown in the patent drawings, Apple's solution allows the contact portion of the tongue to be thicker and sturdier, while positioning it on a thinner, flexible \"stalk\". This stalk will deflect in either direction in order to provide room for mating with existing USB ports while maintaining a strong connection with the contacts. \r<br />\n<br />\n<img src=\"http://cdn.macrumors.com/article-new/2014/08/apple-USB-patent-application.jpg\" alt=\"apple-USB-patent-application\" width=\"608\" height=\"204\" class=\"aligncenter size-full wp-image-420005\" /><center><i>Apple's proposed USB connector with tongue showing durable contact portion (1939) on a thin, flexible stalk</i></center> <br />\nThis flexible tongue provides a distinct advantage over current solutions from <a href=\"http://flipperusb.com/\">competing products</a>, which typically use a rigid tongue that has been slimmed down to fit existing USB ports. Though these cables can be inserted in either orientation, the very thin tongue is susceptible to breakage. With Apple's proposed solution, the contact portion of the tongue can be thicker and more durable, with the flexible portion of the tongue minimizing the possibility of breakage and providing room for the thicker tongue to still fit in either orientation. \r<br />\n<br />\nRecently leaked <a href=\"http://www.macrumors.com/2014/08/15/new-lightning-cable-reversible-usb/\">photos</a> and <a href=\"http://www.macrumors.com/2014/08/19/video-new-lightning-cable-in-action/\">videos</a> suggest Apple may be working on a new Lightning cable with this reversible USB connector. These cables may ship with future iOS devices and also may contain <a href=\"http://www.macrumors.com/2014/05/13/hd-audio-ios-8-new-in-ear-headphones-lightning/\">other features</a> such as support for high-definition audio playback on Made For iPhone (MFi) audio accessories.\n                                        <div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_7",
    "totalcomments": 116,
    "datelast": "Aug 5, 2014, 07:40 PM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_7",
    "title": "Expert Believes Alleged iPhone 6 Sapphire Front Panel Could Be Legitimate   ",
    "author": "Richard_Padilla",
    "date": "Friday July 11, 2014 5:33 am PDT",
    "htmltext": "\t\t\t\t\t\tEarlier this week, <a href=\"http://www.macrumors.com/2014/07/07/iphone-6-front-panel-stress-test/\">numerous</a> <a href=\"http://www.macrumors.com/2014/07/07/iphone-6-front-panel-bend/\">videos</a> of the alleged front panel of the 4.7-inch iPhone 6 surfaced, which showed the screen being put through stress tests involving significant bending and scratching. While those videos referred to the front panel as being made of sapphire crystal, there was no way to confirm that the display were made of the durable material.\r<br />\n<br />\nNow, professor Neil Alford, who is a member of the Department of Materials at the Imperial College in London, tells <em><a href=\"http://www.theguardian.com/technology/2014/jul/11/that-47in-iphone-6-screen-looks-like-sapphire-says-materials-expert-who-spoke-to-apple\">The Guardian</a></em> that the alleged \"sapphire panel\" could \"well be legitimate.\" Alford believes that the stress tests performed on the screen indicate that the panel is made of sapphire, adding that Apple likely overcame a number of challenges in making the part thin and durable.\r<br />\n<br />\n<center><div id=\"video-wrapper\"><div id=\"video-container\"><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/5R0_FJ4r73s?feature=player_detailpage\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div></div></center> <blockquote>Alford concurs: \"In my opinion the screen being shown off in the video could well be a sapphire screen. If you make sapphire thin enough, and it’s flaw free, you can bend it quite considerably because it has an enormous strength.\"\r<br />\n<br />\nHe added: “I think they will be doing some sort of a lamination – binding different crystal cuts of sapphire together – boosting the toughness of the material, while they may also have induced some sort of a strain in the surface of the glass – either compression or tension – which means that it has extra strength,” he said. </blockquote> Alford noted that Apple had contacted him in January 2013 to discuss sapphire screens, indicating that Apple has likely been hard at work on creating the screen afterward. Past rumors have suggested that Apple will be using a sapphire display in the iPhone 6, but other reports have claimed that the more durable material could be <a href=\"http://www.macrumors.com/2014/06/17/iphone-6-sapphire-5-5-iwatch-display/\">exclusive</a> to the larger 5.5-inch iPhone 6 due to supply constraints. \r<br />\n<br />\nApple's 4.7-inch iPhone 6 is expected to <a href=\"http://www.macrumors.com/2014/07/03/apple-event-iphone-6-early-september/\">launch this September</a>, while the larger 5.5-inch version has been rumored to be released <a href=\"http://www.macrumors.com/2014/06/23/4-7-5-5-iphone6-simultaneous-launch/\">at the same time</a>. In addition to a larger display, both devices are likely to include a thinner housing, a faster A8 processor, and an improved camera.<br /><br /><div class=\"linkback\">Related roundup: <a href=\"http://www.macrumors.com/roundup/iphone-6/\">iPhone 6</a> </div>\n<div style=\"clear:both;\"></div>\n",
    "dummy": 1
  },
  {
    "filename": "iphone_9",
    "totalcomments": 119,
    "datelast": "Oct 12, 2013, 05:58 AM",
    "commentid": "http://www.semanticweb.org/ontologies/ConversationInstances.owl#articleiphone_9",
    "title": "Curved Handheld Displays Almost Ready for Market  ",
    "author": "Juli_Clover",
    "date": "Monday October 7, 2013 3:12 pm PDT",
    "image": "http://cdn.macrumors.com/article-new/2013/02/corning_willow_glass.jpg",
    "htmltext": "\t\t\t\t\t\tBoth LG and Samsung plan to release phones that feature curved displays in the near future, reports <a href=\"http://www.reuters.com/article/2013/10/07/us-lg-curved-displays-idUSBRE99607720131007\"><em>Reuters</em></a>. Flexible curved displays, which have <a href=\"http://www.samsung.com/us/video/tvs/KN55S9CAFXZA\">been utilized</a> in television sets, are a developing technology for smartphones and other consumer electronic devices.<blockquote>Curved displays are in the early stages of development and allow bendable or foldable designs that could eventually allow mobile and wearable gadgets to take new forms that could radically change the high-end smartphone market.</blockquote>Apple has been rumored to be working on curved displays for several years, with <a href=\"http://www.macrumors.com/2011/05/23/apple-to-introduce-curved-glass-iphone-5/\">rumors</a> from 2011 suggesting the company could debut a <a href=\"http://www.macrumors.com/2011/09/26/apple-working-on-curved-glass-ios-devices-for-first-half-of-next-year/\">curved glass</a> iPhone. A patent for such a device was <a href=\"http://www.macrumors.com/2013/03/28/apple-researching-iphone-designs-with-flexible-wraparound-displays/\">published</a> in March of this year, depicting a phone with a wraparound body.\r<br />\n<br />\n<img class=\"aligncenter size-full wp-image-366828\" alt=\"corning_willow_glass\" src=\"http://cdn.macrumors.com/article-new/2013/02/corning_willow_glass.jpg\" width=\"540\" height=\"540\" /><center><em>Corning's Willow Glass</em></center> <br />\nMore recently, it has been suggested that the company's rumored iWatch could <a href=\"http://www.macrumors.com/2013/02/10/nyt-apple-is-working-on-a-curved-glass-smart-watch/\">incorporate</a> a curved glass display, using bendable Willow Glass. While Gorilla Glass has claimed that the technology is <a href=\"http://www.macrumors.com/2013/02/28/corning-says-devices-with-flexible-willow-glass-displays-unlikely-to-appear-for-at-least-three-years/\">not yet ready</a> for consumer devices, a plastic-based flexible display similar to the one used by LG and Samsung is readily available.\r<br />\n<br />\nThe debut of LG and Samsung's initial curved display products will provide a glimpse of what the future could hold for upcoming smartphones and other electronic devices, including the iWatch.\r<br />\n<br />\nLG's smartphone is said to utilize a 6-inch display that curves from top to bottom, while Samsung's will curve from side to side. Both displays are built on a plastic substrate that allows them to bend and flex, and according to LG, its display will be among the world's thinnest mobile panels.\r<br />\n<br />\nWhile the phones incorporate displays that bend, it is unclear whether the finished smartphones themselves will be flexible or rigid, similar to the impliable designs used in television sets from both companies.\r<br />\n<br />\nSamsung's smartphone will <a href=\"http://news.cnet.com/8301-1035_3-57604516-94/samsung-to-unveil-smartphone-with-curved-glass-in-october/\">launch</a> in October, while LG's will come slightly later, in November. Apple's iWatch is not expected to <a href=\"http://www.macrumors.com/2013/07/14/apple-aggressively-hiring-for-smart-watch-project-looking-toward-late-2014-launch/\">debut</a> before late 2014. \n                                        <div style=\"clear:both;\"></div>\n",
    "dummy": 1
  }
]